Catalogs/НастройкиАвтозагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НастройкиАвтозагрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСоответствий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыЗагрузки</v8:Type>
						<v8:Type>cfg:CatalogRef.НастройкиСоответствий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайловДляОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогПеремещенныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьРанееЗаписанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогОшибочныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиАвтозагрузки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КаталогФайловДляОбработкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог файлов для обработки...";
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Объект.КаталогФайловДляОбработки = Диалог.Каталог;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогОшибочныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог ошибочных файлов...";
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Объект.КаталогОшибочныхФайлов = Диалог.Каталог;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогПеремещенныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог файлов для перемещения...";
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Объект.КаталогПеремещенныхФайлов = Диалог.Каталог;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловДляОбработкиОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;        
	ЗапуститьПриложение(Объект.КаталогФайловДляОбработки);	
КонецПроцедуры

&НаКлиенте
Процедура КаталогПеремещенныхФайловОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;        
	ЗапуститьПриложение(Объект.КаталогПеремещенныхФайлов);	
КонецПроцедуры

&НаКлиенте
Процедура КаталогОшибочныхФайловОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;        
	ЗапуститьПриложение(Объект.КаталогОшибочныхФайлов);
КонецПроцедуры
